interfaces/src/main/resources/templates/GeefHistoriekGezinssamenstelling/02.02.0000/template.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:web="http://magda.vlaanderen.be/persoon/soap/geefhistoriekgezinssamenstelling/v02_02">
    <soapenv:Header/>
    <soapenv:Body>
        <web:GeefHistoriekGezinssamenstelling>
            <Verzoek>
                <Context>
                    <Naam>GeefHistoriekGezinssamenstelling</Naam>
                    <Versie>02.02.0000</Versie>
                    <Bericht>
                        <Type>VRAAG</Type>
                        <Tijdstip>
                            <Datum>2025-01-01</Datum>
                            <Tijd>12:00</Tijd>
                        </Tijdstip>
                        <Afzender>
                            <Identificatie>Identificatie</Identificatie>
                            <Referte>Referte</Referte>
                            <Hoedanigheid>Hoedanigheid</Hoedanigheid>
                        </Afzender>
                    </Bericht>
                </Context>
                <Vragen>
                    <Vraag>
                        <Referte>Referte</Referte>
                        <Inhoud>
                            <Criteria>
                                <INSZ>90010100123</INSZ>
                                <Datum Op="0">2025-01-01</Datum>
                            </Criteria>
                            <Taal>nl</Taal>
                        </Inhoud>
                    </Vraag>
                </Vragen>
            </Verzoek>
        </web:GeefHistoriekGezinssamenstelling>
    </soapenv:Body>
</soapenv:Envelope>